veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_CH_RCRB_Bits.MSG4 */
#define IFX_PSI5_CH_RCRB_MSG4_OFF (16u)

/** \brief Length for Ifx_PSI5_CH_RCRB_Bits.CRC4 */
#define IFX_PSI5_CH_RCRB_CRC4_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RCRB_Bits.CRC4 */
#define IFX_PSI5_CH_RCRB_CRC4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RCRB_Bits.CRC4 */
#define IFX_PSI5_CH_RCRB_CRC4_OFF (17u)

/** \brief Length for Ifx_PSI5_CH_RCRB_Bits.FEC4 */
#define IFX_PSI5_CH_RCRB_FEC4_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RCRB_Bits.FEC4 */
#define IFX_PSI5_CH_RCRB_FEC4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RCRB_Bits.FEC4 */
#define IFX_PSI5_CH_RCRB_FEC4_OFF (18u)

/** \brief Length for Ifx_PSI5_CH_RCRB_Bits.VBS4 */
#define IFX_PSI5_CH_RCRB_VBS4_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RCRB_Bits.VBS4 */
#define IFX_PSI5_CH_RCRB_VBS4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RCRB_Bits.VBS4 */
#define IFX_PSI5_CH_RCRB_VBS4_OFF (19u)

/** \brief Length for Ifx_PSI5_CH_RCRB_Bits.MSG5 */
#define IFX_PSI5_CH_RCRB_MSG5_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RCRB_Bits.MSG5 */
#define IFX_PSI5_CH_RCRB_MSG5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RCRB_Bits.MSG5 */
#define IFX_PSI5_CH_RCRB_MSG5_OFF (20u)

/** \brief Length for Ifx_PSI5_CH_RCRB_Bits.CRC5 */
#define IFX_PSI5_CH_RCRB_CRC5_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RCRB_Bits.CRC5 */
#define IFX_PSI5_CH_RCRB_CRC5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RCRB_Bits.CRC5 */
#define IFX_PSI5_CH_RCRB_CRC5_OFF (21u)

/** \brief Length for Ifx_PSI5_CH_RCRB_Bits.FEC5 */
#define IFX_PSI5_CH_RCRB_FEC5_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RCRB_Bits.FEC5 */
#define IFX_PSI5_CH_RCRB_FEC5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RCRB_Bits.FEC5 */
#define IFX_PSI5_CH_RCRB_FEC5_OFF (22u)

/** \brief Length for Ifx_PSI5_CH_RCRB_Bits.VBS5 */
#define IFX_PSI5_CH_RCRB_VBS5_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RCRB_Bits.VBS5 */
#define IFX_PSI5_CH_RCRB_VBS5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RCRB_Bits.VBS5 */
#define IFX_PSI5_CH_RCRB_VBS5_OFF (23u)

/** \brief Length for Ifx_PSI5_CH_RCRC_Bits.BRS */
#define IFX_PSI5_CH_RCRC_BRS_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RCRC_Bits.BRS */
#define IFX_PSI5_CH_RCRC_BRS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RCRC_Bits.BRS */
#define IFX_PSI5_CH_RCRC_BRS_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_RCRC_Bits.TSP */
#define IFX_PSI5_CH_RCRC_TSP_LEN (2u)

/** \brief Mask for Ifx_PSI5_CH_RCRC_Bits.TSP */
#define IFX_PSI5_CH_RCRC_TSP_MSK (0x3u)

/** \brief Offset for Ifx_PSI5_CH_RCRC_Bits.TSP */
#define IFX_PSI5_CH_RCRC_TSP_OFF (1u)

/** \brief Length for Ifx_PSI5_CH_RCRC_Bits.TSF */
#define IFX_PSI5_CH_RCRC_TSF_LEN (2u)

/** \brief Mask for Ifx_PSI5_CH_RCRC_Bits.TSF */
#define IFX_PSI5_CH_RCRC_TSF_MSK (0x3u)

/** \brief Offset for Ifx_PSI5_CH_RCRC_Bits.TSF */
#define IFX_PSI5_CH_RCRC_TSF_OFF (3u)

/** \brief Length for Ifx_PSI5_CH_RCRC_Bits.TSR */
#define IFX_PSI5_CH_RCRC_TSR_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RCRC_Bits.TSR */
#define IFX_PSI5_CH_RCRC_TSR_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RCRC_Bits.TSR */
#define IFX_PSI5_CH_RCRC_TSR_OFF (5u)

/** \brief Length for Ifx_PSI5_CH_WDT_Bits.WDL */
#define IFX_PSI5_CH_WDT_WDL_LEN (16u)

/** \brief Mask for Ifx_PSI5_CH_WDT_Bits.WDL */
#define IFX_PSI5_CH_WDT_WDL_MSK (0xffffu)

/** \brief Offset for Ifx_PSI5_CH_WDT_Bits.WDL */
#define IFX_PSI5_CH_WDT_WDL_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_RSR_Bits.CRC */
#define IFX_PSI5_CH_RSR_CRC_LEN (3u)

/** \brief Mask for Ifx_PSI5_CH_RSR_Bits.CRC */
#define IFX_PSI5_CH_RSR_CRC_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_CH_RSR_Bits.CRC */
#define IFX_PSI5_CH_RSR_CRC_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_RSR_Bits.MSG */
#define IFX_PSI5_CH_RSR_MSG_LEN (2u)

/** \brief Mask for Ifx_PSI5_CH_RSR_Bits.MSG */
#define IFX_PSI5_CH_RSR_MSG_MSK (0x3u)

/** \brief Offset for Ifx_PSI5_CH_RSR_Bits.MSG */
#define IFX_PSI5_CH_RSR_MSG_OFF (8u)

/** \brief Length for Ifx_PSI5_CH_SDS_Bits.SD */
#define IFX_PSI5_CH_SDS_SD_LEN (16u)

/** \brief Mask for Ifx_PSI5_CH_SDS_Bits.SD */
#define IFX_PSI5_CH_SDS_SD_MSK (0xffffu)

/** \brief Offset for Ifx_PSI5_CH_SDS_Bits.SD */
#define IFX_PSI5_CH_SDS_SD_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_SDS_Bits.MID */
#define IFX_PSI5_CH_SDS_MID_LEN (8u)

/** \brief Mask for Ifx_PSI5_CH_SDS_Bits.MID */
#define IFX_PSI5_CH_SDS_MID_MSK (0xffu)

/** \brief Offset for Ifx_PSI5_CH_SDS_Bits.MID */
#define IFX_PSI5_CH_SDS_MID_OFF (16u)

/** \brief Length for Ifx_PSI5_CH_SDS_Bits.SCRC */
#define IFX_PSI5_CH_SDS_SCRC_LEN (6u)

/** \brief Mask for Ifx_PSI5_CH_SDS_Bits.SCRC */
#define IFX_PSI5_CH_SDS_SCRC_MSK (0x3fu)

/** \brief Offset for Ifx_PSI5_CH_SDS_Bits.SCRC */
#define IFX_PSI5_CH_SDS_SCRC_OFF (24u)

/** \brief Length for Ifx_PSI5_CH_SDS_Bits.SCRI */
#define IFX_PSI5_CH_SDS_SCRI_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDS_Bits.SCRI */
#define IFX_PSI5_CH_SDS_SCRI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDS_Bits.SCRI */
#define IFX_PSI5_CH_SDS_SCRI_OFF (30u)

/** \brief Length for Ifx_PSI5_CH_SDS_Bits.CON */
#define IFX_PSI5_CH_SDS_CON_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDS_Bits.CON */
#define IFX_PSI5_CH_SDS_CON_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDS_Bits.CON */
#define IFX_PSI5_CH_SDS_CON_OFF (31u)

/** \brief Length for Ifx_PSI5_CH_SPTSC_Bits.TS */
#define IFX_PSI5_CH_SPTSC_TS_LEN (24u)

/** \brief Mask for Ifx_PSI5_CH_SPTSC_Bits.TS */
#define IFX_PSI5_CH_SPTSC_TS_MSK (0xffffffu)

/** \brief Offset for Ifx_PSI5_CH_SPTSC_Bits.TS */
#define IFX_PSI5_CH_SPTSC_TS_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_SFTSC_Bits.TS */
#define IFX_PSI5_CH_SFTSC_TS_LEN (24u)

/** \brief Mask for Ifx_PSI5_CH_SFTSC_Bits.TS */
#define IFX_PSI5_CH_SFTSC_TS_MSK (0xffffffu)

/** \brief Offset for Ifx_PSI5_CH_SFTSC_Bits.TS */
#define IFX_PSI5_CH_SFTSC_TS_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_RDRL_Bits.CRCI */
#define IFX_PSI5_CH_RDRL_CRCI_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_RDRL_Bits.CRCI */
#define IFX_PSI5_CH_RDRL_CRCI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_RDRL_Bits.CRCI */
#define IFX_PSI5_CH_RDRL_CRCI_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_RDRL_Bits.CRC */
#define IFX_PSI5_CH_RDRL_CRC_LEN (3u)

/** \brief Mask for Ifx_PSI5_CH_RDRL_Bits.CRC */
#define IFX_PSI5_CH_RDRL_CRC_MSK (0x7u)

/** \brief Offset for Ifx_PSI5_CH_RDRL_Bits.CRC */
#define IFX_PSI5_CH_RDRL_CRC_OFF (1u)

/** \brief Length for Ifx_PSI5_CH_RDRL_Bits.RD */
#define IFX_PSI5_CH_RDRL_RD_LEN (28u)

/** \brief Mask for Ifx_PSI5_CH_RDRL_Bits.RD */
#define IFX_PSI5_CH_RDRL_RD_MSK (0xfffffffu)

/** \brief Offset for Ifx_PSI5_CH_RDRL_Bits.RD */
#define IFX_PSI5_CH_RDRL_RD_OFF (4u)

