veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD21 */
#define IFX_PSI5_CH_SSRL_SD21_OFF (21u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD22 */
#define IFX_PSI5_CH_SSRL_SD22_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD22 */
#define IFX_PSI5_CH_SSRL_SD22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD22 */
#define IFX_PSI5_CH_SSRL_SD22_OFF (22u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD23 */
#define IFX_PSI5_CH_SSRL_SD23_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD23 */
#define IFX_PSI5_CH_SSRL_SD23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD23 */
#define IFX_PSI5_CH_SSRL_SD23_OFF (23u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD24 */
#define IFX_PSI5_CH_SSRL_SD24_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD24 */
#define IFX_PSI5_CH_SSRL_SD24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD24 */
#define IFX_PSI5_CH_SSRL_SD24_OFF (24u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD25 */
#define IFX_PSI5_CH_SSRL_SD25_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD25 */
#define IFX_PSI5_CH_SSRL_SD25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD25 */
#define IFX_PSI5_CH_SSRL_SD25_OFF (25u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD26 */
#define IFX_PSI5_CH_SSRL_SD26_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD26 */
#define IFX_PSI5_CH_SSRL_SD26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD26 */
#define IFX_PSI5_CH_SSRL_SD26_OFF (26u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD27 */
#define IFX_PSI5_CH_SSRL_SD27_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD27 */
#define IFX_PSI5_CH_SSRL_SD27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD27 */
#define IFX_PSI5_CH_SSRL_SD27_OFF (27u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD28 */
#define IFX_PSI5_CH_SSRL_SD28_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD28 */
#define IFX_PSI5_CH_SSRL_SD28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD28 */
#define IFX_PSI5_CH_SSRL_SD28_OFF (28u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD29 */
#define IFX_PSI5_CH_SSRL_SD29_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD29 */
#define IFX_PSI5_CH_SSRL_SD29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD29 */
#define IFX_PSI5_CH_SSRL_SD29_OFF (29u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD30 */
#define IFX_PSI5_CH_SSRL_SD30_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD30 */
#define IFX_PSI5_CH_SSRL_SD30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD30 */
#define IFX_PSI5_CH_SSRL_SD30_OFF (30u)

/** \brief Length for Ifx_PSI5_CH_SSRL_Bits.SD31 */
#define IFX_PSI5_CH_SSRL_SD31_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRL_Bits.SD31 */
#define IFX_PSI5_CH_SSRL_SD31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRL_Bits.SD31 */
#define IFX_PSI5_CH_SSRL_SD31_OFF (31u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD32 */
#define IFX_PSI5_CH_SSRH_SD32_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD32 */
#define IFX_PSI5_CH_SSRH_SD32_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD32 */
#define IFX_PSI5_CH_SSRH_SD32_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD33 */
#define IFX_PSI5_CH_SSRH_SD33_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD33 */
#define IFX_PSI5_CH_SSRH_SD33_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD33 */
#define IFX_PSI5_CH_SSRH_SD33_OFF (1u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD34 */
#define IFX_PSI5_CH_SSRH_SD34_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD34 */
#define IFX_PSI5_CH_SSRH_SD34_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD34 */
#define IFX_PSI5_CH_SSRH_SD34_OFF (2u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD35 */
#define IFX_PSI5_CH_SSRH_SD35_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD35 */
#define IFX_PSI5_CH_SSRH_SD35_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD35 */
#define IFX_PSI5_CH_SSRH_SD35_OFF (3u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD36 */
#define IFX_PSI5_CH_SSRH_SD36_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD36 */
#define IFX_PSI5_CH_SSRH_SD36_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD36 */
#define IFX_PSI5_CH_SSRH_SD36_OFF (4u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD37 */
#define IFX_PSI5_CH_SSRH_SD37_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD37 */
#define IFX_PSI5_CH_SSRH_SD37_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD37 */
#define IFX_PSI5_CH_SSRH_SD37_OFF (5u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD38 */
#define IFX_PSI5_CH_SSRH_SD38_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD38 */
#define IFX_PSI5_CH_SSRH_SD38_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD38 */
#define IFX_PSI5_CH_SSRH_SD38_OFF (6u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD39 */
#define IFX_PSI5_CH_SSRH_SD39_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD39 */
#define IFX_PSI5_CH_SSRH_SD39_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD39 */
#define IFX_PSI5_CH_SSRH_SD39_OFF (7u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD40 */
#define IFX_PSI5_CH_SSRH_SD40_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD40 */
#define IFX_PSI5_CH_SSRH_SD40_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD40 */
#define IFX_PSI5_CH_SSRH_SD40_OFF (8u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD41 */
#define IFX_PSI5_CH_SSRH_SD41_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD41 */
#define IFX_PSI5_CH_SSRH_SD41_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD41 */
#define IFX_PSI5_CH_SSRH_SD41_OFF (9u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD42 */
#define IFX_PSI5_CH_SSRH_SD42_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD42 */
#define IFX_PSI5_CH_SSRH_SD42_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SSRH_Bits.SD42 */
#define IFX_PSI5_CH_SSRH_SD42_OFF (10u)

/** \brief Length for Ifx_PSI5_CH_SSRH_Bits.SD43 */
#define IFX_PSI5_CH_SSRH_SD43_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SSRH_Bits.SD43 */
#define IFX_PSI5_CH_SSRH_SD43_MSK (0x1u)

