veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI13 */
#define IFX_PSI5_RSIOV_RSI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI13 */
#define IFX_PSI5_RSIOV_RSI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI13 */
#define IFX_PSI5_RSIOV_RSI13_OFF (13u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI14 */
#define IFX_PSI5_RSIOV_RSI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI14 */
#define IFX_PSI5_RSIOV_RSI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI14 */
#define IFX_PSI5_RSIOV_RSI14_OFF (14u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI15 */
#define IFX_PSI5_RSIOV_RSI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI15 */
#define IFX_PSI5_RSIOV_RSI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI15 */
#define IFX_PSI5_RSIOV_RSI15_OFF (15u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI16 */
#define IFX_PSI5_RSIOV_RSI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI16 */
#define IFX_PSI5_RSIOV_RSI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI16 */
#define IFX_PSI5_RSIOV_RSI16_OFF (16u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI17 */
#define IFX_PSI5_RSIOV_RSI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI17 */
#define IFX_PSI5_RSIOV_RSI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI17 */
#define IFX_PSI5_RSIOV_RSI17_OFF (17u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI18 */
#define IFX_PSI5_RSIOV_RSI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI18 */
#define IFX_PSI5_RSIOV_RSI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI18 */
#define IFX_PSI5_RSIOV_RSI18_OFF (18u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI19 */
#define IFX_PSI5_RSIOV_RSI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI19 */
#define IFX_PSI5_RSIOV_RSI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI19 */
#define IFX_PSI5_RSIOV_RSI19_OFF (19u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI20 */
#define IFX_PSI5_RSIOV_RSI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI20 */
#define IFX_PSI5_RSIOV_RSI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI20 */
#define IFX_PSI5_RSIOV_RSI20_OFF (20u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI21 */
#define IFX_PSI5_RSIOV_RSI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI21 */
#define IFX_PSI5_RSIOV_RSI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI21 */
#define IFX_PSI5_RSIOV_RSI21_OFF (21u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI22 */
#define IFX_PSI5_RSIOV_RSI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI22 */
#define IFX_PSI5_RSIOV_RSI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI22 */
#define IFX_PSI5_RSIOV_RSI22_OFF (22u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI23 */
#define IFX_PSI5_RSIOV_RSI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI23 */
#define IFX_PSI5_RSIOV_RSI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI23 */
#define IFX_PSI5_RSIOV_RSI23_OFF (23u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI24 */
#define IFX_PSI5_RSIOV_RSI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI24 */
#define IFX_PSI5_RSIOV_RSI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI24 */
#define IFX_PSI5_RSIOV_RSI24_OFF (24u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI25 */
#define IFX_PSI5_RSIOV_RSI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI25 */
#define IFX_PSI5_RSIOV_RSI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI25 */
#define IFX_PSI5_RSIOV_RSI25_OFF (25u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI26 */
#define IFX_PSI5_RSIOV_RSI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI26 */
#define IFX_PSI5_RSIOV_RSI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI26 */
#define IFX_PSI5_RSIOV_RSI26_OFF (26u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI27 */
#define IFX_PSI5_RSIOV_RSI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI27 */
#define IFX_PSI5_RSIOV_RSI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI27 */
#define IFX_PSI5_RSIOV_RSI27_OFF (27u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI28 */
#define IFX_PSI5_RSIOV_RSI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI28 */
#define IFX_PSI5_RSIOV_RSI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI28 */
#define IFX_PSI5_RSIOV_RSI28_OFF (28u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI29 */
#define IFX_PSI5_RSIOV_RSI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI29 */
#define IFX_PSI5_RSIOV_RSI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI29 */
#define IFX_PSI5_RSIOV_RSI29_OFF (29u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI30 */
#define IFX_PSI5_RSIOV_RSI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI30 */
#define IFX_PSI5_RSIOV_RSI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI30 */
#define IFX_PSI5_RSIOV_RSI30_OFF (30u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI31 */
#define IFX_PSI5_RSIOV_RSI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI31 */
#define IFX_PSI5_RSIOV_RSI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI31 */
#define IFX_PSI5_RSIOV_RSI31_OFF (31u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI0 */
#define IFX_PSI5_RMIOV_RMI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI0 */
#define IFX_PSI5_RMIOV_RMI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI0 */
#define IFX_PSI5_RMIOV_RMI0_OFF (0u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI1 */
#define IFX_PSI5_RMIOV_RMI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI1 */
#define IFX_PSI5_RMIOV_RMI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI1 */
#define IFX_PSI5_RMIOV_RMI1_OFF (1u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI2 */
#define IFX_PSI5_RMIOV_RMI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI2 */
#define IFX_PSI5_RMIOV_RMI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI2 */
#define IFX_PSI5_RMIOV_RMI2_OFF (2u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI3 */
#define IFX_PSI5_RMIOV_RMI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI3 */
#define IFX_PSI5_RMIOV_RMI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI3 */
#define IFX_PSI5_RMIOV_RMI3_OFF (3u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI4 */
#define IFX_PSI5_RMIOV_RMI4_LEN (1u)

