veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI26 */
#define IFX_PSI5_RMIOV_RMI26_OFF (26u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI27 */
#define IFX_PSI5_RMIOV_RMI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI27 */
#define IFX_PSI5_RMIOV_RMI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI27 */
#define IFX_PSI5_RMIOV_RMI27_OFF (27u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI28 */
#define IFX_PSI5_RMIOV_RMI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI28 */
#define IFX_PSI5_RMIOV_RMI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI28 */
#define IFX_PSI5_RMIOV_RMI28_OFF (28u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI29 */
#define IFX_PSI5_RMIOV_RMI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI29 */
#define IFX_PSI5_RMIOV_RMI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI29 */
#define IFX_PSI5_RMIOV_RMI29_OFF (29u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI30 */
#define IFX_PSI5_RMIOV_RMI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI30 */
#define IFX_PSI5_RMIOV_RMI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI30 */
#define IFX_PSI5_RMIOV_RMI30_OFF (30u)

/** \brief Length for Ifx_PSI5_RMIOV_Bits.RMI31 */
#define IFX_PSI5_RMIOV_RMI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMIOV_Bits.RMI31 */
#define IFX_PSI5_RMIOV_RMI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMIOV_Bits.RMI31 */
#define IFX_PSI5_RMIOV_RMI31_OFF (31u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI0 */
#define IFX_PSI5_NBIOV_NBI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI0 */
#define IFX_PSI5_NBIOV_NBI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI0 */
#define IFX_PSI5_NBIOV_NBI0_OFF (0u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI1 */
#define IFX_PSI5_NBIOV_NBI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI1 */
#define IFX_PSI5_NBIOV_NBI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI1 */
#define IFX_PSI5_NBIOV_NBI1_OFF (1u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI2 */
#define IFX_PSI5_NBIOV_NBI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI2 */
#define IFX_PSI5_NBIOV_NBI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI2 */
#define IFX_PSI5_NBIOV_NBI2_OFF (2u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI3 */
#define IFX_PSI5_NBIOV_NBI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI3 */
#define IFX_PSI5_NBIOV_NBI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI3 */
#define IFX_PSI5_NBIOV_NBI3_OFF (3u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI4 */
#define IFX_PSI5_NBIOV_NBI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI4 */
#define IFX_PSI5_NBIOV_NBI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI4 */
#define IFX_PSI5_NBIOV_NBI4_OFF (4u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI5 */
#define IFX_PSI5_NBIOV_NBI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI5 */
#define IFX_PSI5_NBIOV_NBI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI5 */
#define IFX_PSI5_NBIOV_NBI5_OFF (5u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI6 */
#define IFX_PSI5_NBIOV_NBI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI6 */
#define IFX_PSI5_NBIOV_NBI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI6 */
#define IFX_PSI5_NBIOV_NBI6_OFF (6u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI7 */
#define IFX_PSI5_NBIOV_NBI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI7 */
#define IFX_PSI5_NBIOV_NBI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI7 */
#define IFX_PSI5_NBIOV_NBI7_OFF (7u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI8 */
#define IFX_PSI5_NBIOV_NBI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI8 */
#define IFX_PSI5_NBIOV_NBI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI8 */
#define IFX_PSI5_NBIOV_NBI8_OFF (8u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI9 */
#define IFX_PSI5_NBIOV_NBI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI9 */
#define IFX_PSI5_NBIOV_NBI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI9 */
#define IFX_PSI5_NBIOV_NBI9_OFF (9u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI10 */
#define IFX_PSI5_NBIOV_NBI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI10 */
#define IFX_PSI5_NBIOV_NBI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI10 */
#define IFX_PSI5_NBIOV_NBI10_OFF (10u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI11 */
#define IFX_PSI5_NBIOV_NBI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI11 */
#define IFX_PSI5_NBIOV_NBI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI11 */
#define IFX_PSI5_NBIOV_NBI11_OFF (11u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI12 */
#define IFX_PSI5_NBIOV_NBI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI12 */
#define IFX_PSI5_NBIOV_NBI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI12 */
#define IFX_PSI5_NBIOV_NBI12_OFF (12u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI13 */
#define IFX_PSI5_NBIOV_NBI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI13 */
#define IFX_PSI5_NBIOV_NBI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI13 */
#define IFX_PSI5_NBIOV_NBI13_OFF (13u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI14 */
#define IFX_PSI5_NBIOV_NBI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI14 */
#define IFX_PSI5_NBIOV_NBI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI14 */
#define IFX_PSI5_NBIOV_NBI14_OFF (14u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI15 */
#define IFX_PSI5_NBIOV_NBI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI15 */
#define IFX_PSI5_NBIOV_NBI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI15 */
#define IFX_PSI5_NBIOV_NBI15_OFF (15u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI16 */
#define IFX_PSI5_NBIOV_NBI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI16 */
#define IFX_PSI5_NBIOV_NBI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI16 */
#define IFX_PSI5_NBIOV_NBI16_OFF (16u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI17 */
#define IFX_PSI5_NBIOV_NBI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI17 */
#define IFX_PSI5_NBIOV_NBI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI17 */
#define IFX_PSI5_NBIOV_NBI17_OFF (17u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI18 */
#define IFX_PSI5_NBIOV_NBI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI18 */
#define IFX_PSI5_NBIOV_NBI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI18 */
#define IFX_PSI5_NBIOV_NBI18_OFF (18u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI19 */
#define IFX_PSI5_NBIOV_NBI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI19 */
#define IFX_PSI5_NBIOV_NBI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI19 */
#define IFX_PSI5_NBIOV_NBI19_OFF (19u)

