veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_NFIOV_Bits.NFI31 */
#define IFX_PSI5_NFIOV_NFI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFIOV_Bits.NFI31 */
#define IFX_PSI5_NFIOV_NFI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFIOV_Bits.NFI31 */
#define IFX_PSI5_NFIOV_NFI31_OFF (31u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI0 */
#define IFX_PSI5_MEIOV_MEI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI0 */
#define IFX_PSI5_MEIOV_MEI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI0 */
#define IFX_PSI5_MEIOV_MEI0_OFF (0u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI1 */
#define IFX_PSI5_MEIOV_MEI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI1 */
#define IFX_PSI5_MEIOV_MEI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI1 */
#define IFX_PSI5_MEIOV_MEI1_OFF (1u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI2 */
#define IFX_PSI5_MEIOV_MEI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI2 */
#define IFX_PSI5_MEIOV_MEI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI2 */
#define IFX_PSI5_MEIOV_MEI2_OFF (2u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI3 */
#define IFX_PSI5_MEIOV_MEI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI3 */
#define IFX_PSI5_MEIOV_MEI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI3 */
#define IFX_PSI5_MEIOV_MEI3_OFF (3u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI4 */
#define IFX_PSI5_MEIOV_MEI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI4 */
#define IFX_PSI5_MEIOV_MEI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI4 */
#define IFX_PSI5_MEIOV_MEI4_OFF (4u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI5 */
#define IFX_PSI5_MEIOV_MEI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI5 */
#define IFX_PSI5_MEIOV_MEI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI5 */
#define IFX_PSI5_MEIOV_MEI5_OFF (5u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI6 */
#define IFX_PSI5_MEIOV_MEI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI6 */
#define IFX_PSI5_MEIOV_MEI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI6 */
#define IFX_PSI5_MEIOV_MEI6_OFF (6u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI7 */
#define IFX_PSI5_MEIOV_MEI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI7 */
#define IFX_PSI5_MEIOV_MEI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI7 */
#define IFX_PSI5_MEIOV_MEI7_OFF (7u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI8 */
#define IFX_PSI5_MEIOV_MEI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI8 */
#define IFX_PSI5_MEIOV_MEI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI8 */
#define IFX_PSI5_MEIOV_MEI8_OFF (8u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI9 */
#define IFX_PSI5_MEIOV_MEI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI9 */
#define IFX_PSI5_MEIOV_MEI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI9 */
#define IFX_PSI5_MEIOV_MEI9_OFF (9u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI10 */
#define IFX_PSI5_MEIOV_MEI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI10 */
#define IFX_PSI5_MEIOV_MEI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI10 */
#define IFX_PSI5_MEIOV_MEI10_OFF (10u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI11 */
#define IFX_PSI5_MEIOV_MEI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI11 */
#define IFX_PSI5_MEIOV_MEI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI11 */
#define IFX_PSI5_MEIOV_MEI11_OFF (11u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI12 */
#define IFX_PSI5_MEIOV_MEI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI12 */
#define IFX_PSI5_MEIOV_MEI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI12 */
#define IFX_PSI5_MEIOV_MEI12_OFF (12u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI13 */
#define IFX_PSI5_MEIOV_MEI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI13 */
#define IFX_PSI5_MEIOV_MEI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI13 */
#define IFX_PSI5_MEIOV_MEI13_OFF (13u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI14 */
#define IFX_PSI5_MEIOV_MEI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI14 */
#define IFX_PSI5_MEIOV_MEI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI14 */
#define IFX_PSI5_MEIOV_MEI14_OFF (14u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI15 */
#define IFX_PSI5_MEIOV_MEI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI15 */
#define IFX_PSI5_MEIOV_MEI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI15 */
#define IFX_PSI5_MEIOV_MEI15_OFF (15u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI16 */
#define IFX_PSI5_MEIOV_MEI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI16 */
#define IFX_PSI5_MEIOV_MEI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI16 */
#define IFX_PSI5_MEIOV_MEI16_OFF (16u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI17 */
#define IFX_PSI5_MEIOV_MEI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI17 */
#define IFX_PSI5_MEIOV_MEI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI17 */
#define IFX_PSI5_MEIOV_MEI17_OFF (17u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI18 */
#define IFX_PSI5_MEIOV_MEI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI18 */
#define IFX_PSI5_MEIOV_MEI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI18 */
#define IFX_PSI5_MEIOV_MEI18_OFF (18u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI19 */
#define IFX_PSI5_MEIOV_MEI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI19 */
#define IFX_PSI5_MEIOV_MEI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI19 */
#define IFX_PSI5_MEIOV_MEI19_OFF (19u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI20 */
#define IFX_PSI5_MEIOV_MEI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI20 */
#define IFX_PSI5_MEIOV_MEI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI20 */
#define IFX_PSI5_MEIOV_MEI20_OFF (20u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI21 */
#define IFX_PSI5_MEIOV_MEI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI21 */
#define IFX_PSI5_MEIOV_MEI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI21 */
#define IFX_PSI5_MEIOV_MEI21_OFF (21u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI22 */
#define IFX_PSI5_MEIOV_MEI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI22 */
#define IFX_PSI5_MEIOV_MEI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI22 */
#define IFX_PSI5_MEIOV_MEI22_OFF (22u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI23 */
#define IFX_PSI5_MEIOV_MEI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI23 */
#define IFX_PSI5_MEIOV_MEI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI23 */
#define IFX_PSI5_MEIOV_MEI23_OFF (23u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI24 */
#define IFX_PSI5_MEIOV_MEI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI24 */
#define IFX_PSI5_MEIOV_MEI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI24 */
#define IFX_PSI5_MEIOV_MEI24_OFF (24u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI25 */
#define IFX_PSI5_MEIOV_MEI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI25 */
#define IFX_PSI5_MEIOV_MEI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI25 */
#define IFX_PSI5_MEIOV_MEI25_OFF (25u)

