veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI17 */
#define IFX_PSI5_RSISET_RSI17_OFF (17u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI18 */
#define IFX_PSI5_RSISET_RSI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI18 */
#define IFX_PSI5_RSISET_RSI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI18 */
#define IFX_PSI5_RSISET_RSI18_OFF (18u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI19 */
#define IFX_PSI5_RSISET_RSI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI19 */
#define IFX_PSI5_RSISET_RSI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI19 */
#define IFX_PSI5_RSISET_RSI19_OFF (19u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI20 */
#define IFX_PSI5_RSISET_RSI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI20 */
#define IFX_PSI5_RSISET_RSI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI20 */
#define IFX_PSI5_RSISET_RSI20_OFF (20u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI21 */
#define IFX_PSI5_RSISET_RSI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI21 */
#define IFX_PSI5_RSISET_RSI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI21 */
#define IFX_PSI5_RSISET_RSI21_OFF (21u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI22 */
#define IFX_PSI5_RSISET_RSI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI22 */
#define IFX_PSI5_RSISET_RSI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI22 */
#define IFX_PSI5_RSISET_RSI22_OFF (22u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI23 */
#define IFX_PSI5_RSISET_RSI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI23 */
#define IFX_PSI5_RSISET_RSI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI23 */
#define IFX_PSI5_RSISET_RSI23_OFF (23u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI24 */
#define IFX_PSI5_RSISET_RSI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI24 */
#define IFX_PSI5_RSISET_RSI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI24 */
#define IFX_PSI5_RSISET_RSI24_OFF (24u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI25 */
#define IFX_PSI5_RSISET_RSI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI25 */
#define IFX_PSI5_RSISET_RSI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI25 */
#define IFX_PSI5_RSISET_RSI25_OFF (25u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI26 */
#define IFX_PSI5_RSISET_RSI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI26 */
#define IFX_PSI5_RSISET_RSI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI26 */
#define IFX_PSI5_RSISET_RSI26_OFF (26u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI27 */
#define IFX_PSI5_RSISET_RSI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI27 */
#define IFX_PSI5_RSISET_RSI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI27 */
#define IFX_PSI5_RSISET_RSI27_OFF (27u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI28 */
#define IFX_PSI5_RSISET_RSI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI28 */
#define IFX_PSI5_RSISET_RSI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI28 */
#define IFX_PSI5_RSISET_RSI28_OFF (28u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI29 */
#define IFX_PSI5_RSISET_RSI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI29 */
#define IFX_PSI5_RSISET_RSI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI29 */
#define IFX_PSI5_RSISET_RSI29_OFF (29u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI30 */
#define IFX_PSI5_RSISET_RSI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI30 */
#define IFX_PSI5_RSISET_RSI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI30 */
#define IFX_PSI5_RSISET_RSI30_OFF (30u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI31 */
#define IFX_PSI5_RSISET_RSI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI31 */
#define IFX_PSI5_RSISET_RSI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI31 */
#define IFX_PSI5_RSISET_RSI31_OFF (31u)

/** \brief Length for Ifx_PSI5_RMISET_Bits.RMI0 */
#define IFX_PSI5_RMISET_RMI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMISET_Bits.RMI0 */
#define IFX_PSI5_RMISET_RMI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMISET_Bits.RMI0 */
#define IFX_PSI5_RMISET_RMI0_OFF (0u)

/** \brief Length for Ifx_PSI5_RMISET_Bits.RMI1 */
#define IFX_PSI5_RMISET_RMI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMISET_Bits.RMI1 */
#define IFX_PSI5_RMISET_RMI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMISET_Bits.RMI1 */
#define IFX_PSI5_RMISET_RMI1_OFF (1u)

/** \brief Length for Ifx_PSI5_RMISET_Bits.RMI2 */
#define IFX_PSI5_RMISET_RMI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMISET_Bits.RMI2 */
#define IFX_PSI5_RMISET_RMI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMISET_Bits.RMI2 */
#define IFX_PSI5_RMISET_RMI2_OFF (2u)

/** \brief Length for Ifx_PSI5_RMISET_Bits.RMI3 */
#define IFX_PSI5_RMISET_RMI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMISET_Bits.RMI3 */
#define IFX_PSI5_RMISET_RMI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMISET_Bits.RMI3 */
#define IFX_PSI5_RMISET_RMI3_OFF (3u)

/** \brief Length for Ifx_PSI5_RMISET_Bits.RMI4 */
#define IFX_PSI5_RMISET_RMI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMISET_Bits.RMI4 */
#define IFX_PSI5_RMISET_RMI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMISET_Bits.RMI4 */
#define IFX_PSI5_RMISET_RMI4_OFF (4u)

/** \brief Length for Ifx_PSI5_RMISET_Bits.RMI5 */
#define IFX_PSI5_RMISET_RMI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMISET_Bits.RMI5 */
#define IFX_PSI5_RMISET_RMI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMISET_Bits.RMI5 */
#define IFX_PSI5_RMISET_RMI5_OFF (5u)

/** \brief Length for Ifx_PSI5_RMISET_Bits.RMI6 */
#define IFX_PSI5_RMISET_RMI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMISET_Bits.RMI6 */
#define IFX_PSI5_RMISET_RMI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMISET_Bits.RMI6 */
#define IFX_PSI5_RMISET_RMI6_OFF (6u)

/** \brief Length for Ifx_PSI5_RMISET_Bits.RMI7 */
#define IFX_PSI5_RMISET_RMI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMISET_Bits.RMI7 */
#define IFX_PSI5_RMISET_RMI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMISET_Bits.RMI7 */
#define IFX_PSI5_RMISET_RMI7_OFF (7u)

